benchmark/results/90VUS-with-proxy.txt
  █ TOTAL RESULTS 

    checks_total.......................: 425402 787.778636/s
    checks_succeeded...................: 59.92% 254924 out of 425402
    checks_failed......................: 40.07% 170478 out of 425402

    ✗ POST /register status is 200
      ↳  59% — ✓ 127448 / ✗ 85253
    ✗ GET /list status is 200
      ↳  59% — ✓ 127476 / ✗ 85225

    HTTP
    http_req_duration.......................................................: avg=69.95ms min=1.62ms med=62.18ms  max=334.43ms p(90)=127.46ms p(95)=139.1ms 
      { expected_response:true }............................................: avg=53.47ms min=1.62ms med=45.45ms  max=334.43ms p(90)=104.46ms p(95)=116.47ms
    http_req_failed.........................................................: 40.07% 170478 out of 425402
    http_reqs...............................................................: 425402 787.778636/s

    EXECUTION
    iteration_duration......................................................: avg=140.2ms min=3.83ms med=125.87ms max=567.51ms p(90)=254.11ms p(95)=274.45ms
    iterations..............................................................: 212701 393.889318/s
    vus.....................................................................: 1      min=1                max=89
    vus_max.................................................................: 90     min=90               max=90

    NETWORK
    data_received...........................................................: 378 MB 701 kB/s
    data_sent...............................................................: 71 MB  132 kB/s



running (9m00.0s), 00/90 VUs, 212701 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/90 VUs  9m0s