benchmark/results/90VUS-without-proxy.txt
  █ TOTAL RESULTS 

    checks_total.......................: 428756 793.983911/s
    checks_succeeded...................: 60.87% 261018 out of 428756
    checks_failed......................: 39.12% 167738 out of 428756

    ✗ POST /register status is 200
      ↳  60% — ✓ 130577 / ✗ 83801
    ✗ GET /list status is 200
      ↳  60% — ✓ 130441 / ✗ 83937

    HTTP
    http_req_duration.......................................................: avg=69.41ms  min=1.36ms med=64.37ms  max=340.29ms p(90)=124.78ms p(95)=138.1ms 
      { expected_response:true }............................................: avg=51.83ms  min=1.36ms med=42.5ms   max=340.29ms p(90)=101ms    p(95)=113.93ms
    http_req_failed.........................................................: 39.12% 167738 out of 428756
    http_reqs...............................................................: 428756 793.983911/s

    EXECUTION
    iteration_duration......................................................: avg=139.11ms min=3.04ms med=130.48ms max=491.91ms p(90)=247.92ms p(95)=273.42ms
    iterations..............................................................: 214378 396.991956/s
    vus.....................................................................: 1      min=1                max=89
    vus_max.................................................................: 90     min=90               max=90

    NETWORK
    data_received...........................................................: 382 MB 708 kB/s
    data_sent...............................................................: 56 MB  103 kB/s



running (9m00.0s), 00/90 VUs, 214378 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/90 VUs  9m0s